// Напишіть код, який обчислює обмін валют за курсом, заданим за допомогою константи const rate = КУРС ВАЛЮТИ Вважайте значення в одній валюті за допомогою 'prompt', після чого помножіть/поділіть це число на 'rate'. Виведіть результат, використовуючи alert. Обмежте кількість знаків після коми двома (нас не хвилюють дрібні частини центів/копійок)
debugger;
const rate = 40.7374565441
var grn = prompt ("Введіть кількість гривень")
var dlr = grn * rate .toFixed (2)
alert ("Кількіть долларів: " + dlr)