// Напишіть код, який обчислює обмін валют за курсом, заданим за допомогою константи const rate = КУРС ВАЛЮТИ Вважайте значення в одній валюті за допомогою 'prompt', після чого помножіть/поділіть це число на 'rate'. Виведіть результат, використовуючи alert. Обмежте кількість знаків після коми двома (нас не хвилюють дрібні частини центів/копійок)
debugger;
const dlr_per_grn = 40.7374565441
let grn = prompt ("Введіть кількість гривень")
let dlr = grn * dlr_per_grn 
alert ("Кількіть долларів: " + dlr.toFixed (2))